{
  "main": {
    "name":"Dhrumil Shah",
    "image":"profile_pic.jpg",
    "bio":"I am a hard-working and performance-driven Software Developer with skilled in Web Development and Machine Learning. Strong computer science professional skills with a Master's degree focused on Applied Computing from the University of Windsor. I have built numerous websites and web applications by following the Agile methodologies being a Full Stack Developer. I have a specialization in JavaScript and have professional experience in RESTful APIs making using Node.js, Python as well as database design using MongoDB, SQL, and Front-end development with React.",
    "contactmessage":"Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "sdhrumil2605@gmail.com",
    "phone": "(519) 991-4992",
    "address":{
      "street":"920 Elm Avenue",
      "city":"Windsor",
      "state":"Ontario",
      "zip": "N9A 5H5"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/1CEnv_Cptjg16WQDzZpDBxXMjnn_E08Nw/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/dhrumilshah.26",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/dhrumilshah26/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/dhrumil.26",
        "className":"fa fa-instagram"
      },
      {
        "name":"stack-overflow",
        "url":"https://stackexchange.com/users/16025968/dhrumil-shah",
        "className":"fa fa-stack-overflow"
      },
      {
        "name":"github",
        "url":"https://github.com/DhrumilShah26",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education":[
      {
        "school":"University of Windsor",
        "degree":"Master of Applied Computing",
        "graduated":"Jan 2020 - Present"
      },
      {
        "school":"L.D. College of Engineering, Gujarat Technological University",
        "degree":"Bachelor of Engineering in Computer Engineering",
        "graduated":"Aug 2015 - May 2019"
      }
    ],
    "skills":[
      {
        "name":"Git",
        "description":"I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image":"git.jpg"
      },
      {
        "name":"Java",
        "description":"Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image":"java.jpg"
      },
      {
        "name":"React Js",
        "description":"I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image":"react.jpg"
      },
      {
        "name":"Meteor JS",
        "description":"I enjoy MeteorJS for it's ease of configuration and its ability to get a full stack prototype up and running quickly. I used MeteorJS in a team for a Startup Programming class in UVIC in conjunction with React to build the MVP for Smirkspace (below in portfolio)",
        "image":"meteor.jpg"
      },

      {
        "name":"Node JS",
        "description":"Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image":"node.jpg"
      },
      {
        "name":"Bootstrap 4",
        "description":"I use Bootstrap more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image":"bootstrap.jpg"
      },
      {
        "name":"MongoDB",
        "description":"I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image":"mongo.jpg"
      },
      {
        "name":"Heroku",
        "description":"I use Heroku as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient. I also appreciate its integration with Github for such simple deployment.",
        "image":"heroku.jpg"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"https://original-thai-food.herokuapp.com/index.html"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"https://github.com/tbakerx/react-resume-template"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"I have had the opportunity to work with Tim on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. Tim excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user":"Alastair Beaumont - Web Developer at AppColony"
      }
    ]
  }
}
